# Read and write in csv

In [1]:
import pandas as pd 
df = pd.read_csv("E:\Python\L1.3\B17.csv")
df

   Name  Market Cap  No.of.Shares  PE    Eps      Debt  Book Value
0   ITC   269686.78       1230.88  20  10.00      9.58       46.73
1    AP    41153.54        385.69   0  -0.59  14371.57       40.70
2    TM    99874.86        332.00   0 -26.84  25444.77       45.30
3  Info   576659.14        426.07  32  41.44      0.00      156.89
4   Tcs  1173989.84        375.00  37  82.65      0.00      222.10

In [6]:
#skiprows skip the row 

df = pd.read_csv("E:\Python\L1.3\B17.csv", skiprows=1)
df

    ITC   269686.78  1230.88  20     10      9.58   46.73
0    AP    41153.54   385.69   0  -0.59  14371.57   40.70
1    TM    99874.86   332.00   0 -26.84  25444.77   45.30
2  Info   576659.14   426.07  32  41.44      0.00  156.89
3   Tcs  1173989.84   375.00  37  82.65      0.00  222.10

In [7]:
df = pd.read_csv("E:\Python\L1.3\B17.csv", header=None, names = ["ticker","Market cap","no of shares","PE","Eps","Debt","Book Value" ])
df

  ticker  Market cap  no of shares  PE     Eps      Debt  Book Value
0   Name  Market Cap  No.of.Shares  PE     Eps      Debt  Book Value
1    ITC   269686.78       1230.88  20      10      9.58       46.73
2     AP    41153.54        385.69   0   -0.59  14371.57        40.7
3     TM    99874.86           332   0  -26.84  25444.77        45.3
4   Info   576659.14        426.07  32   41.44         0      156.89
5    Tcs  1173989.84           375  37   82.65         0       222.1

In [8]:
df = pd.read_csv("E:\Python\L1.3\B17.csv",  nrows=2)
df

  Name  Market Cap  No.of.Shares  PE    Eps      Debt  Book Value
0  ITC   269686.78       1230.88  20  10.00      9.58       46.73
1   AP    41153.54        385.69   0  -0.59  14371.57       40.70

In [11]:
df = pd.read_csv("E:\Python\L1.3\stock_data_C.csv")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [10]:
# Replace "not available" to nan

df = pd.read_csv("E:\Python\L1.3\stock_data_C.csv", na_values=["n.a.", "not available"])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [12]:
df = pd.read_csv("E:\Python\L1.3\stock_data_C.csv",  na_values={
        'eps': ['not available'],
        'revenue': [-1],
        'people': ['not available','n.a.']
    })
df

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3    RIL     NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

# Write the dataframes

In [15]:
#write means create new file with change
df.to_csv("new.csv", index=False)

In [16]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

# Read and write in xlsx

In [17]:
df = pd.read_excel("E:\Python\L1.3\stock_data.xlsx","Sheet1")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [19]:
# Repalcing na vlaue with other value
def convert_people_cell(cell):
    if cell=="n.a.":
        return 'Sam Walton'
    return cell

def convert_price_cell(cell):
    if cell=="n.a.":
        return 50
    return cell
    
df = pd.read_excel("E:\Python\L1.3\stock_data.xlsx","Sheet1", converters= {
        'people': convert_people_cell,
        'price': convert_price_cell
    })
df

  tickers            eps  revenue  price         people
0   GOOGL          27.82       87    845     larry page
1     WMT           4.61      484     65     Sam Walton
2    MSFT             -1       85     64     bill gates
3    RIL   not available       50   1023  mukesh ambani
4    TATA            5.6       -1     50     ratan tata

# Write two dataframes to two separate sheets in excel

In [20]:
df_stocks = pd.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845, 65, 64 ],
    'pe': [30.37, 14.26, 30.97],
    'eps': [27.82, 4.61, 2.12]
})

df_weather =  pd.DataFrame({
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'event': ['Rain', 'Sunny', 'Snow']
})

In [21]:

with pd.ExcelWriter('stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name="stocks")
    df_weather.to_excel(writer, sheet_name="weather")